[
  {
    "role": "Full Stack Software Engineer",
    "period": "February 2023 – Present",
    "company": "Carter Labs",
    "description": "At Carter Labs, I spearhead the creation of systems that provide sophisticated AI conversation and companionship to users worldwide. I am responsible for designing, engineering, testing, deploying, and maintaining these systems. In addition, I implement and continuously improve a suite of developer tooling, CI/CD pipelines, and monitoring solutions to streamline development processes and enhance the team’s capacity to deliver with confidence.\nMy work encompasses a broad spectrum of technologies to facilitate the end-to-end processing of user interactions. This includes leveraging AWS cloud infrastructure to architect scalable, resilient, and efficient systems, among which I develop a robust and idiomatic API that serves as the backbone for various client-facing and internal platforms.\nThrough my work here, I am honing my skills in working effectively in a fast-paced development environment, delivering high-quality results under tight deadlines.",
    "badges": ["AWS", "MongoDB", "Python", "FastAPI", "Docker", "Nuxt", "TypeScript", "SCSS", "Git"]
  },
  {
    "role": "Software Developer & Accounting Clerk",
    "period": "July 2018 – February 2023",
    "company": "Accountancy Corporation in London",
    "description": "Working at this organisation has awarded me valuable experience in the use of computer systems in the industry. I have had the opportunity to develop software to optimise workflows, including ingesting and parsing bank statements, managing sensitive customer information, and updating critical internal databases with the most up-to-date knowledge.",
    "badges": ["Rust", "Vue.js", "Excel", "Netlify", "Git"]
  },
  {
    "role": "Software Developer",
    "period": "September 2014 – June 2017",
    "company": "ACW Technologies",
    "description": "As co-founder of this non-profit software organisation, I managed all main operations including the design and development of all software, websites, and infrastructure.",
    "badges": ["C#", ".NET", "WPF", "Git", "PHP", "Jekyll", "SQL", "Cloudflare"]
  },
  {
    "role": "Clerical Assistant",
    "period": "July 2015 – August 2015",
    "company": "H H Burke & Co",
    "description": "School work experience in an accountancy office during which I improved my communication, organisation, and time management skills."
  }
]
